==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ConvolutionalNetwork                     [64, 2]                   --
├─Sequential: 1-1                        [64, 512, 7, 7]           3,908,992
│    └─Conv2d: 2-1                       [64, 64, 250, 250]        1,792
├─Sequential: 1-10                       --                        (recursive)
│    └─ReLU: 2-2                         [64, 64, 250, 250]        --
├─Sequential: 1-11                       --                        (recursive)
│    └─MaxPool2d: 2-3                    [64, 64, 125, 125]        --
│    └─Conv2d: 2-4                       [64, 128, 125, 125]       73,856
├─Sequential: 1-10                       --                        (recursive)
│    └─ReLU: 2-5                         [64, 128, 125, 125]       --
├─Sequential: 1-11                       --                        (recursive)
│    └─MaxPool2d: 2-6                    [64, 128, 62, 62]         --
│    └─Conv2d: 2-7                       [64, 256, 62, 62]         295,168
├─Sequential: 1-10                       --                        (recursive)
│    └─ReLU: 2-8                         [64, 256, 62, 62]         --
├─Sequential: 1-11                       --                        (recursive)
│    └─MaxPool2d: 2-9                    [64, 256, 31, 31]         --
│    └─Conv2d: 2-10                      [64, 512, 31, 31]         1,180,160
├─Sequential: 1-10                       --                        (recursive)
│    └─ReLU: 2-11                        [64, 512, 31, 31]         --
├─Sequential: 1-11                       --                        (recursive)
│    └─MaxPool2d: 2-12                   [64, 512, 15, 15]         --
│    └─Conv2d: 2-13                      [64, 512, 15, 15]         2,359,808
├─Sequential: 1-10                       --                        (recursive)
│    └─ReLU: 2-14                        [64, 512, 15, 15]         --
├─Sequential: 1-11                       --                        (recursive)
│    └─MaxPool2d: 2-15                   [64, 512, 7, 7]           --
├─Sequential: 1-12                       [64, 2]                   --
│    └─Linear: 2-16                      [64, 512]                 12,845,568
│    └─ReLU: 2-17                        [64, 512]                 --
│    └─Dropout: 2-18                     [64, 512]                 --
│    └─Linear: 2-19                      [64, 256]                 131,328
│    └─ReLU: 2-20                        [64, 256]                 --
│    └─Dropout: 2-21                     [64, 256]                 --
│    └─Linear: 2-22                      [64, 2]                   514
==========================================================================================
Total params: 20,797,186
Trainable params: 20,797,186
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 261.04
==========================================================================================
Input size (MB): 48.00
Forward/backward pass size (MB): 3887.14
Params size (MB): 67.55
Estimated Total Size (MB): 4002.69
==========================================================================================
Training and Validation Metrics:
Train Losses: [0.694, 0.693, 0.6888, 0.6816, 0.6736, 0.6736, 0.6718, 0.6707, 0.6633, 0.6628, 0.6551, 0.644, 0.6408, 0.637, 0.6232, 0.6237, 0.6225, 0.6171, 0.6161, 0.6091, 0.6165, 0.6278, 0.6271, 0.6168, 0.5976, 0.6139, 0.6046, 0.5877, 0.5986, 0.5964, 0.5936, 0.5881, 0.5849, 0.5855, 0.6032, 0.572, 0.5916, 0.5824, 0.5945, 0.5873, 0.5604, 0.5533, 0.5535, 0.5641, 0.5606, 0.5524, 0.5505, 0.5376, 0.5585, 0.5473, 0.5497, 0.5389, 0.5416, 0.5455, 0.5199, 0.5431, 0.5135, 0.5583, 0.5172, 0.518, 0.5012, 0.4996, 0.4891, 0.5054, 0.4899, 0.5083, 0.4963, 0.5158, 0.4942, 0.4776, 0.4954, 0.4748, 0.4878, 0.465, 0.4509, 0.4939, 0.4732, 0.4686, 0.4378, 0.4728]
Train Accuracies: [49.45, 50.45, 56.55, 58.05, 58.25, 58.85, 59.45, 59.9, 61.0, 60.25, 62.45, 62.55, 62.7, 63.4, 64.65, 65.0, 65.45, 65.2, 65.7, 66.4, 66.35, 62.3, 64.6, 65.0, 67.55, 66.1, 66.9, 68.4, 67.15, 68.6, 67.35, 68.3, 70.7, 68.4, 66.6, 70.45, 68.3, 68.8, 67.6, 68.85, 69.15, 70.75, 71.5, 69.55, 69.1, 71.95, 70.85, 71.55, 71.15, 71.2, 71.4, 73.0, 71.95, 71.75, 73.4, 70.75, 72.75, 71.1, 73.85, 73.15, 75.75, 74.35, 76.05, 73.85, 75.25, 73.9, 74.4, 73.6, 75.2, 75.85, 75.85, 75.95, 75.85, 76.9, 77.3, 74.35, 75.85, 76.2, 79.55, 76.3]
Val Losses: [0.6929, 0.6912, 0.6687, 0.6699, 0.6649, 0.6699, 0.6464, 0.6561, 0.6339, 0.6459, 0.6455, 0.6411, 0.6242, 0.6274, 0.6179, 0.6376, 0.6125, 0.6243, 0.605, 0.6148, 0.6204, 0.6606, 0.613, 0.5974, 0.5787, 0.61, 0.5994, 0.6082, 0.5913, 0.5665, 0.5797, 0.5885, 0.5763, 0.6038, 0.5863, 0.5575, 0.5448, 0.5676, 0.5518, 0.5355, 0.6001, 0.5371, 0.6056, 0.5273, 0.5778, 0.55, 0.5377, 0.5365, 0.5178, 0.5394, 0.5438, 0.5153, 0.5083, 0.5101, 0.511, 0.5068, 0.5441, 0.4753, 0.5626, 0.5062, 0.5234, 0.4993, 0.4944, 0.4614, 0.4951, 0.4377, 0.456, 0.5596, 0.5067, 0.4462, 0.4287, 0.4534, 0.4495, 0.4689, 0.4427, 0.5571, 0.4381, 0.3983, 0.6133, 0.4102]
Val Accuracies: [50.0, 55.17, 56.67, 53.67, 56.17, 59.67, 61.83, 63.33, 64.5, 65.0, 60.5, 63.33, 65.0, 63.5, 66.33, 61.0, 66.33, 66.5, 66.0, 67.0, 63.5, 59.17, 65.33, 69.33, 70.0, 68.5, 67.33, 69.17, 69.33, 71.17, 71.5, 70.5, 69.17, 67.67, 70.17, 71.17, 73.67, 72.5, 73.5, 74.33, 71.0, 73.67, 71.83, 73.17, 73.33, 72.0, 73.0, 75.0, 74.83, 74.0, 74.5, 76.17, 75.33, 76.5, 76.17, 73.67, 75.67, 78.33, 74.83, 77.17, 77.5, 80.5, 78.5, 81.0, 77.17, 81.5, 80.67, 73.83, 77.83, 81.17, 81.17, 81.0, 81.17, 80.83, 81.33, 75.83, 80.67, 84.83, 75.83, 84.5]
