==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ConvolutionalNetwork                     [64, 2]                   --
├─Sequential: 1-1                        [64, 256, 14, 14]         388,416
│    └─Conv2d: 2-1                       [64, 32, 224, 224]        896
│    └─BatchNorm2d: 2-2                  [64, 32, 224, 224]        64
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-3                         [64, 32, 224, 224]        --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-4                    [64, 32, 112, 112]        --
│    └─Conv2d: 2-5                       [64, 64, 112, 112]        18,496
│    └─BatchNorm2d: 2-6                  [64, 64, 112, 112]        128
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-7                         [64, 64, 112, 112]        --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-8                    [64, 64, 56, 56]          --
│    └─Conv2d: 2-9                       [64, 128, 56, 56]         73,856
│    └─BatchNorm2d: 2-10                 [64, 128, 56, 56]         256
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-11                        [64, 128, 56, 56]         --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-12                   [64, 128, 28, 28]         --
│    └─Conv2d: 2-13                      [64, 256, 28, 28]         295,168
│    └─BatchNorm2d: 2-14                 [64, 256, 28, 28]         512
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-15                        [64, 256, 28, 28]         --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-16                   [64, 256, 14, 14]         --
├─Sequential: 1-10                       [64, 2]                   --
│    └─Linear: 2-17                      [64, 256]                 12,845,312
│    └─BatchNorm1d: 2-18                 [64, 256]                 512
│    └─ReLU: 2-19                        [64, 256]                 --
│    └─Dropout: 2-20                     [64, 256]                 --
│    └─Linear: 2-21                      [64, 128]                 32,896
│    └─BatchNorm1d: 2-22                 [64, 128]                 256
│    └─ReLU: 2-23                        [64, 128]                 --
│    └─Dropout: 2-24                     [64, 128]                 --
│    └─Linear: 2-25                      [64, 2]                   258
==========================================================================================
Total params: 13,657,026
Trainable params: 13,657,026
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 48.18
==========================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 3083.21
Params size (MB): 53.07
Estimated Total Size (MB): 3174.82
==========================================================================================
Training and Validation Metrics:
Train Losses: [0.6962, 0.6597, 0.6288, 0.5979, 0.5828, 0.58, 0.5622, 0.5561, 0.5447, 0.5238, 0.5209, 0.516, 0.5104, 0.4879, 0.4844, 0.4893, 0.4809, 0.4896, 0.4742, 0.4576, 0.4478, 0.422, 0.4385, 0.4452, 0.4184, 0.4355, 0.4517, 0.4137, 0.4234, 0.4175, 0.398, 0.3954, 0.3764, 0.3727, 0.3894, 0.3736, 0.3521, 0.3841, 0.3636, 0.3646, 0.3341, 0.3456, 0.3361, 0.325, 0.3379, 0.3135, 0.3069, 0.3151, 0.3276, 0.3132, 0.3066, 0.3112, 0.3156, 0.3116, 0.2975, 0.305, 0.305, 0.305, 0.3016, 0.2823, 0.2761, 0.2846, 0.3026, 0.2699, 0.2812, 0.2652, 0.2534, 0.2712, 0.2681, 0.2444, 0.2469, 0.2669, 0.2582, 0.2702, 0.2332, 0.2543, 0.2333, 0.225, 0.2584, 0.2141, 0.238, 0.2045, 0.2251, 0.2103, 0.2098, 0.2307, 0.2109, 0.236, 0.2013, 0.1938, 0.1927, 0.2265, 0.2065, 0.1946, 0.1932, 0.2053, 0.184, 0.206, 0.1801, 0.1802, 0.1609, 0.1848, 0.1772, 0.1614, 0.166, 0.1755, 0.1603, 0.1622, 0.1887, 0.1603, 0.1324, 0.1569, 0.1614, 0.1423, 0.1704, 0.1626, 0.1605, 0.1431, 0.1447, 0.149]
Train Accuracies: [56.95, 58.95, 64.65, 67.8, 68.55, 68.15, 70.75, 72.35, 72.15, 73.8, 74.15, 73.65, 74.75, 75.85, 76.6, 76.2, 77.3, 76.25, 77.5, 78.55, 78.45, 81.1, 79.4, 78.0, 81.15, 80.25, 79.4, 82.15, 80.2, 81.0, 81.0, 81.2, 82.85, 84.4, 82.7, 82.2, 84.2, 82.6, 84.7, 84.25, 85.1, 85.15, 86.0, 85.95, 85.6, 86.95, 86.9, 86.0, 86.0, 86.35, 87.05, 86.45, 86.65, 86.35, 87.35, 86.0, 87.3, 87.45, 87.3, 87.1, 88.35, 87.85, 86.6, 88.85, 87.6, 89.1, 89.5, 88.05, 88.85, 89.45, 89.15, 89.15, 88.95, 89.15, 90.9, 89.5, 90.0, 90.5, 87.75, 90.85, 89.85, 91.65, 90.8, 91.55, 90.8, 90.75, 91.4, 90.4, 91.5, 92.55, 92.95, 91.05, 91.95, 91.65, 92.35, 92.25, 93.0, 91.9, 92.45, 93.25, 93.85, 93.05, 92.55, 93.15, 93.2, 93.05, 93.75, 93.65, 91.5, 94.0, 94.55, 93.7, 92.95, 94.7, 93.15, 92.75, 93.4, 93.75, 93.85, 94.25]
Val Losses: [0.8926, 0.6464, 0.6925, 0.6143, 0.601, 0.6204, 0.6065, 0.5784, 0.5474, 0.6497, 0.5724, 0.6286, 0.6504, 0.5559, 0.591, 0.622, 0.546, 0.5584, 0.5032, 0.4965, 0.509, 0.5131, 0.5742, 0.546, 0.4871, 0.4897, 0.4839, 0.4873, 0.6243, 0.4784, 0.4372, 0.5249, 0.4968, 0.4571, 0.4526, 0.4761, 0.4387, 0.4475, 0.4355, 0.4286, 0.4978, 0.4592, 0.6471, 0.4087, 0.4383, 0.4213, 0.4665, 0.4264, 0.3953, 0.4257, 0.5127, 0.5312, 0.3942, 0.4176, 0.4386, 0.717, 0.418, 0.437, 0.3755, 0.4339, 0.4827, 0.4043, 0.4255, 0.5582, 0.4267, 0.423, 0.4107, 0.3898, 0.4008, 0.3871, 0.4005, 0.3852, 0.3484, 0.3432, 0.4229, 0.43, 0.4691, 0.4165, 0.4136, 0.4059, 0.3663, 0.3784, 0.4138, 0.4051, 0.4096, 0.574, 0.414, 0.6556, 0.3833, 0.3877, 0.4278, 0.415, 0.3894, 0.3629, 0.8695, 0.4317, 0.4594, 0.4642, 0.3906, 0.4055, 0.4797, 0.5259, 0.6819, 0.3821, 0.4707, 0.4738, 0.4198, 0.4181, 0.7485, 0.4439, 0.3805, 0.4204, 0.4518, 0.5452, 0.4222, 0.3715, 0.4975, 0.7164, 0.4568, 0.3999]
Val Accuracies: [54.83, 63.17, 56.33, 61.5, 70.17, 69.33, 68.17, 71.33, 71.67, 66.0, 71.17, 67.5, 68.5, 73.5, 72.17, 70.5, 71.0, 71.0, 75.67, 75.83, 75.33, 77.83, 71.17, 72.67, 77.0, 77.67, 75.33, 76.67, 69.5, 78.0, 80.67, 76.83, 76.67, 80.17, 79.33, 78.33, 81.0, 80.83, 80.5, 80.67, 79.33, 81.5, 70.5, 81.5, 79.83, 82.33, 80.67, 80.67, 83.17, 82.5, 78.83, 78.5, 83.5, 81.83, 83.5, 74.0, 80.67, 83.0, 83.5, 82.5, 80.83, 84.0, 81.83, 81.83, 84.67, 83.0, 84.5, 83.83, 83.0, 85.33, 83.0, 82.83, 87.33, 86.67, 84.33, 84.33, 83.5, 84.67, 84.5, 86.0, 85.33, 86.5, 85.33, 85.67, 86.0, 78.33, 86.0, 79.67, 87.17, 85.0, 85.17, 84.83, 85.17, 86.83, 73.67, 85.5, 85.0, 82.5, 85.5, 86.67, 84.5, 83.67, 79.17, 86.83, 85.33, 86.0, 86.17, 85.83, 81.0, 85.5, 87.83, 87.0, 85.67, 84.83, 86.17, 87.5, 85.0, 81.0, 86.17, 87.67]
