==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ConvolutionalNetwork                     [64, 2]                   --
├─Sequential: 1-1                        [64, 256, 14, 14]         388,416
│    └─Conv2d: 2-1                       [64, 32, 224, 224]        896
│    └─BatchNorm2d: 2-2                  [64, 32, 224, 224]        64
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-3                         [64, 32, 224, 224]        --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-4                    [64, 32, 112, 112]        --
│    └─Conv2d: 2-5                       [64, 64, 112, 112]        18,496
│    └─BatchNorm2d: 2-6                  [64, 64, 112, 112]        128
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-7                         [64, 64, 112, 112]        --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-8                    [64, 64, 56, 56]          --
│    └─Conv2d: 2-9                       [64, 128, 56, 56]         73,856
│    └─BatchNorm2d: 2-10                 [64, 128, 56, 56]         256
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-11                        [64, 128, 56, 56]         --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-12                   [64, 128, 28, 28]         --
│    └─Conv2d: 2-13                      [64, 256, 28, 28]         295,168
│    └─BatchNorm2d: 2-14                 [64, 256, 28, 28]         512
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-15                        [64, 256, 28, 28]         --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-16                   [64, 256, 14, 14]         --
├─Sequential: 1-10                       [64, 2]                   --
│    └─Linear: 2-17                      [64, 256]                 12,845,312
│    └─BatchNorm1d: 2-18                 [64, 256]                 512
│    └─ReLU: 2-19                        [64, 256]                 --
│    └─Dropout: 2-20                     [64, 256]                 --
│    └─Linear: 2-21                      [64, 128]                 32,896
│    └─BatchNorm1d: 2-22                 [64, 128]                 256
│    └─ReLU: 2-23                        [64, 128]                 --
│    └─Dropout: 2-24                     [64, 128]                 --
│    └─Linear: 2-25                      [64, 2]                   258
==========================================================================================
Total params: 13,657,026
Trainable params: 13,657,026
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 48.18
==========================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 3083.21
Params size (MB): 53.07
Estimated Total Size (MB): 3174.82
==========================================================================================
Training and Validation Metrics:
Train Losses: [0.6836, 0.6343, 0.6051, 0.5782, 0.5681, 0.5626, 0.554, 0.5263, 0.5294, 0.5449, 0.5085, 0.5174, 0.5021, 0.4755, 0.514, 0.4761, 0.4528, 0.4641, 0.4549, 0.4364, 0.4396, 0.4259, 0.4458, 0.425, 0.4174, 0.3966, 0.3544, 0.3779, 0.368, 0.3695, 0.3606, 0.3457, 0.3729, 0.3425, 0.3354, 0.3577, 0.3456, 0.3322, 0.3058, 0.3404, 0.3401, 0.2948, 0.3022, 0.3162, 0.3307, 0.3134, 0.3016, 0.3121, 0.3283, 0.2865, 0.2695, 0.273, 0.2533, 0.2447, 0.2711, 0.2641, 0.2395, 0.2488, 0.2345, 0.2545, 0.2547, 0.2528, 0.2303, 0.2378, 0.2459, 0.2132, 0.2265, 0.2146, 0.2202, 0.2231, 0.2257, 0.2224, 0.2189, 0.215, 0.1934, 0.2077, 0.1775, 0.1895, 0.1848, 0.1781, 0.188, 0.1884, 0.2066, 0.1839, 0.1813, 0.1831, 0.1765, 0.1671, 0.1641, 0.1715, 0.1762, 0.1673, 0.1655, 0.1607, 0.1577, 0.1712, 0.1462, 0.1576, 0.1636, 0.1412, 0.1632, 0.1473, 0.1616, 0.1503, 0.1607, 0.1445, 0.1506, 0.1465, 0.148, 0.1402, 0.142, 0.1481, 0.1451, 0.1347, 0.135, 0.1492, 0.139, 0.1388, 0.1387, 0.1183]
Train Accuracies: [59.3, 63.45, 65.35, 69.55, 70.35, 70.25, 70.65, 72.7, 74.8, 73.15, 73.8, 75.65, 75.25, 77.8, 75.05, 77.0, 79.15, 78.05, 78.2, 79.45, 80.25, 81.0, 80.75, 80.05, 80.8, 83.2, 84.8, 83.6, 83.1, 83.45, 83.85, 85.0, 83.15, 85.3, 85.3, 85.05, 84.6, 85.55, 86.4, 85.35, 85.35, 87.25, 86.25, 86.1, 85.55, 86.85, 86.4, 86.8, 86.2, 87.75, 89.45, 88.4, 89.05, 90.15, 88.95, 88.65, 90.3, 89.3, 89.45, 89.45, 89.15, 89.35, 90.4, 89.85, 90.0, 91.4, 90.7, 91.25, 90.65, 90.0, 90.9, 90.1, 90.4, 91.35, 91.4, 91.25, 92.9, 91.7, 92.0, 92.9, 92.5, 92.7, 92.2, 92.3, 92.65, 92.3, 93.15, 93.0, 93.55, 92.65, 92.65, 93.35, 93.7, 93.3, 93.45, 93.15, 94.35, 93.35, 93.6, 94.25, 93.05, 94.1, 93.85, 94.05, 93.95, 94.15, 93.9, 93.8, 94.65, 93.95, 93.65, 94.8, 94.6, 94.5, 95.25, 93.6, 94.25, 94.5, 94.65, 94.95]
Val Losses: [0.6645, 0.7115, 0.6021, 0.6, 0.6545, 0.6416, 0.5522, 0.5408, 0.5783, 0.5389, 0.5492, 0.5291, 0.5505, 0.5586, 0.5026, 0.5039, 0.5285, 0.4713, 0.6147, 0.5405, 0.5171, 0.4854, 0.4847, 0.4432, 0.5482, 0.4327, 0.441, 0.5682, 0.4246, 0.4102, 0.4239, 0.4096, 0.4049, 0.4355, 0.4183, 0.4828, 0.3931, 0.3965, 0.4111, 0.4212, 0.4509, 0.3992, 0.3992, 0.4753, 0.4022, 0.3986, 0.5512, 0.4064, 0.4151, 0.4047, 0.5261, 0.3803, 0.3699, 0.3862, 0.4081, 0.379, 0.3818, 0.4039, 0.4069, 0.3925, 0.3998, 0.3963, 0.3564, 0.3902, 0.4037, 0.406, 0.4332, 0.4085, 0.393, 0.3705, 0.5548, 0.3889, 0.3737, 0.3786, 0.4055, 0.3716, 0.3672, 0.3786, 0.383, 0.3858, 0.3819, 0.4351, 0.4312, 0.3898, 0.4003, 0.3869, 0.3765, 0.3776, 0.3761, 0.4062, 0.3752, 0.4252, 0.3844, 0.3873, 0.375, 0.3911, 0.373, 0.4075, 0.3994, 0.4108, 0.3921, 0.3816, 0.3904, 0.4195, 0.383, 0.3717, 0.3647, 0.3742, 0.3903, 0.3808, 0.4025, 0.4009, 0.3759, 0.3902, 0.3958, 0.4291, 0.3823, 0.4105, 0.3825, 0.3888]
Val Accuracies: [60.33, 60.0, 67.83, 68.5, 61.83, 65.83, 71.83, 73.67, 66.67, 72.67, 72.5, 74.17, 72.83, 73.17, 75.67, 75.33, 75.0, 77.33, 72.17, 77.0, 76.33, 76.17, 75.67, 79.17, 72.5, 79.83, 79.5, 78.0, 80.0, 81.83, 79.5, 81.83, 81.67, 78.67, 79.17, 80.33, 82.5, 83.17, 82.83, 79.83, 80.83, 82.67, 83.0, 81.5, 82.17, 83.33, 76.83, 82.17, 81.83, 80.0, 78.67, 83.0, 83.0, 82.5, 82.17, 83.67, 84.17, 83.33, 83.33, 81.67, 82.0, 83.33, 84.17, 83.17, 83.33, 82.5, 82.83, 82.83, 83.83, 82.83, 79.5, 85.33, 82.83, 85.0, 84.5, 83.33, 85.33, 85.17, 84.5, 84.5, 84.33, 84.17, 84.5, 84.67, 84.67, 84.67, 84.5, 84.17, 85.5, 84.83, 85.67, 83.67, 85.33, 85.83, 84.67, 85.67, 85.67, 84.67, 85.17, 85.17, 86.17, 86.5, 86.83, 85.33, 86.17, 86.67, 85.5, 85.67, 85.17, 86.33, 85.33, 84.5, 85.83, 86.5, 85.83, 85.17, 86.33, 85.83, 86.17, 86.5]
