==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ConvolutionalNetwork                     [64, 2]                   --
├─Sequential: 1-1                        [64, 256, 14, 14]         387,520
│    └─Conv2d: 2-1                       [64, 32, 224, 224]        896
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-2                         [64, 32, 224, 224]        --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-3                    [64, 32, 112, 112]        --
│    └─Conv2d: 2-4                       [64, 64, 112, 112]        18,496
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-5                         [64, 64, 112, 112]        --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-6                    [64, 64, 56, 56]          --
│    └─Conv2d: 2-7                       [64, 128, 56, 56]         73,856
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-8                         [64, 128, 56, 56]         --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-9                    [64, 128, 28, 28]         --
│    └─Conv2d: 2-10                      [64, 256, 28, 28]         295,168
├─Sequential: 1-8                        --                        (recursive)
│    └─ReLU: 2-11                        [64, 256, 28, 28]         --
├─Sequential: 1-9                        --                        (recursive)
│    └─MaxPool2d: 2-12                   [64, 256, 14, 14]         --
├─Sequential: 1-10                       [64, 2]                   --
│    └─Linear: 2-13                      [64, 256]                 12,845,312
│    └─ReLU: 2-14                        [64, 256]                 --
│    └─Linear: 2-15                      [64, 128]                 32,896
│    └─ReLU: 2-16                        [64, 128]                 --
│    └─Linear: 2-17                      [64, 2]                   258
==========================================================================================
Total params: 13,654,402
Trainable params: 13,654,402
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 48.18
==========================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 1541.60
Params size (MB): 53.07
Estimated Total Size (MB): 1633.21
==========================================================================================
Training and Validation Metrics:
Train Losses: [0.6993, 0.6887, 0.6741, 0.6585, 0.6362, 0.6456, 0.6268, 0.5956, 0.5954, 0.5829, 0.5528, 0.5702, 0.562, 0.5349, 0.5182, 0.5148, 0.5102, 0.4952, 0.4751, 0.509, 0.4694, 0.4792, 0.4788, 0.4517, 0.468, 0.4405, 0.4167, 0.4321, 0.4186, 0.3955, 0.4084, 0.4047, 0.395, 0.3725, 0.3804, 0.3622, 0.3508, 0.3602, 0.3631, 0.3399, 0.3385, 0.3468, 0.3079, 0.306, 0.3078, 0.3082, 0.2908, 0.2913, 0.2999, 0.2677, 0.2886, 0.2837, 0.2482, 0.2712, 0.2595, 0.2551, 0.2601, 0.2447, 0.235, 0.2132, 0.2118, 0.2384, 0.2133, 0.2394, 0.2035, 0.1863, 0.2244, 0.2325, 0.1998, 0.2016, 0.1953, 0.1889, 0.1908, 0.1587, 0.1864, 0.2025, 0.2189, 0.1657, 0.1579, 0.169, 0.1574, 0.139, 0.1736, 0.1688, 0.1723, 0.1582, 0.1581, 0.1418, 0.1391, 0.1502, 0.1742, 0.1559, 0.1403, 0.1377, 0.1625, 0.1205, 0.1424, 0.1252, 0.1403, 0.1561]
Train Accuracies: [51.95, 54.35, 56.7, 59.05, 62.95, 62.4, 64.9, 67.8, 68.85, 68.7, 69.7, 70.7, 71.05, 73.2, 75.05, 74.2, 75.2, 75.85, 77.45, 76.05, 77.2, 77.55, 77.2, 79.45, 77.1, 79.8, 81.65, 79.4, 80.35, 81.15, 80.3, 81.9, 82.6, 83.0, 82.55, 83.4, 83.95, 82.75, 83.0, 85.2, 85.2, 84.55, 86.85, 85.8, 86.85, 87.15, 87.65, 86.8, 86.1, 88.85, 86.6, 86.95, 89.65, 88.0, 89.05, 89.2, 89.0, 89.3, 89.3, 91.45, 91.15, 90.2, 90.75, 90.1, 92.1, 92.6, 90.95, 90.75, 91.4, 92.2, 92.25, 92.35, 91.7, 93.3, 92.4, 91.7, 90.25, 93.1, 93.15, 93.05, 93.65, 93.8, 92.9, 93.2, 93.3, 93.95, 93.6, 94.3, 94.65, 94.3, 92.35, 94.3, 93.8, 94.55, 93.45, 95.5, 94.7, 94.85, 94.35, 93.35]
Val Losses: [0.6871, 0.6817, 0.7115, 0.72, 0.7436, 0.6577, 0.6372, 0.6734, 0.6061, 0.6146, 0.5787, 0.5778, 0.5806, 0.5553, 0.5373, 0.5364, 0.5454, 0.5685, 0.5282, 0.5607, 0.6033, 0.5561, 0.4994, 0.4998, 0.5092, 0.4881, 0.5135, 0.5251, 0.4979, 0.5862, 0.5214, 0.4672, 0.4686, 0.4649, 0.4615, 0.4371, 0.5811, 0.5131, 0.4636, 0.4587, 0.4265, 0.4635, 0.482, 0.4466, 0.5168, 0.4346, 0.5287, 0.7375, 0.5368, 0.5307, 0.5241, 0.4412, 0.6024, 0.4387, 0.5045, 0.4804, 0.4966, 0.5357, 0.5183, 0.6632, 0.5945, 0.5278, 0.5441, 0.5707, 0.5408, 0.5121, 0.7281, 0.5094, 0.5004, 0.5739, 0.5297, 0.5005, 0.5572, 0.6189, 0.5356, 0.5756, 0.5982, 0.5662, 0.5716, 0.5701, 0.6302, 0.5653, 0.5072, 0.5902, 0.5292, 0.597, 0.5172, 0.5668, 0.5137, 0.4722, 0.493, 0.4555, 0.5494, 0.4655, 0.6041, 0.6954, 0.6465, 0.5893, 0.5168, 0.5937]
Val Accuracies: [60.83, 50.17, 55.5, 57.17, 63.0, 60.33, 64.17, 63.33, 65.5, 68.5, 72.0, 69.0, 68.5, 72.17, 72.5, 74.0, 73.0, 73.67, 74.33, 72.5, 73.33, 72.5, 76.67, 76.83, 75.17, 76.67, 78.67, 75.17, 79.0, 78.0, 77.83, 78.83, 80.17, 79.67, 79.83, 81.17, 77.33, 77.0, 80.5, 79.33, 81.5, 81.33, 79.0, 82.33, 80.33, 81.33, 81.67, 77.5, 80.0, 81.83, 79.5, 83.17, 79.83, 84.0, 83.0, 84.0, 82.33, 81.5, 83.5, 81.5, 82.0, 83.0, 82.83, 81.5, 83.0, 82.33, 80.67, 81.83, 82.17, 82.83, 82.67, 83.0, 82.83, 83.17, 82.0, 80.0, 81.0, 83.33, 83.67, 82.33, 83.67, 86.0, 82.33, 82.33, 84.0, 84.17, 84.5, 85.33, 87.33, 86.5, 84.0, 86.33, 83.33, 86.67, 85.17, 85.0, 83.33, 84.33, 85.5, 86.17]
